In [1]:
import pandas as pd
import numpy as np

In [9]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3,np.nan,5,6], index=['A','B','C','D','E','F'])

In [13]:
data = {'Gender': ['F', 'M', 'M'],'Emp_ID': ['E01', 'E02','E03'], 'Age': [25, 27, 25]}
df = pd.DataFrame(data, columns=['Emp_ID','Gender', 'Age'])
print(df) 
print()
print(df.Emp_ID)
print()
print(df.Emp_ID[0])

  Emp_ID Gender  Age
0    E01      F   25
1    E02      M   27
2    E03      M   25

0    E01
1    E02
2    E03
Name: Emp_ID, dtype: object

E01

In [14]:
df=pd.read_csv("/Users/saikarthik/Desktop/ml algorithms from scratch /pandas/employees - employees.csv")

In [15]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [ ]:
df.corr()